Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ألم تعلم أن الله يعلم ما في السماء والأرض إن ذلك في كتاب إن ذلك على الله يسير
en: Know you not that Allah knows all that is in the heaven and on the earth? Verily, it is (all) in the Book (Al-Lauh-al-Mahfuz). Verily that is easy for Allah.

source: ويعبدون من دون الله ما لم ينزل به سلطانا وما ليس لهم به علم وما للظالمين من نصير
en: And they worship besides Allah others for which He has sent down no authority, and of which they have no knowledge; and for the Zalimun (wrong-doers, polytheists and disbelievers in the Oneness of Allah) there is no helper.

source: وإذا تتلى عليهم آياتنا بينات تعرف في وجوه الذين كفروا المنكر يكادون يسطون بالذين يتلون عليهم آياتنا قل أفأنبئكم بشر من ذلكم النار وعدها الله الذين كفروا وبئس المصير
en: And when Our Clear Verses are recited to them, you will notice a denial on the faces of the disbelievers! They are nearly ready to attack with violence those who recite Our Verses to them. Say: "Shall I tell you of something worse than that? The Fire (of Hell) which Allah has promised to those who disbelieved, and worst indeed is that destination!"

source: يا أيها الناس ضرب مثل فاستمعوا له إن الذين تدعون من دون الله لن يخلقوا ذبابا ولو اجتمعوا له وإن يسلبهم الذباب شيئا لا يستنقذوه منه ضعف الطالب والمطلوب
en: O mankind! A similitude has been coined, so listen to it (carefully): Verily those on whom you call besides Allah, cannot create (even) a fly, even though they combine together for the purpose. And if the fly snatches away a thing from them, they will have no power to release it from the fly. So weak are (both) the seeker and the sought.

source: ما قدروا الله حق قدره إن الله لقوي عزيز
en: They have not estimated Allah His Rightful Estimate. Verily, Allah is All-Strong, All-Mighty.

source: الله يصطفي من الملائكة رسلا ومن الناس إن الله سميع بصير
en: Allah chooses Messengers from angels and from men. Verily, Allah is All-Hearer, All-Seer.

source: يعلم ما بين أيديهم وما خلفهم وإلى الله ترجع الأمور
en: He knows what is before them, and what is behind them. And to Allah return all matters (for decision).

source: يا أيها الذين آمنوا اركعوا واسجدوا واعبدوا ربكم وافعلوا الخير لعلكم تفلحون
en: O you who have believed! Bow down, and prostrate yourselves, and worship your Lord and do good that you may be successful.

source: وجاهدوا في الله حق جهاده هو اجتباكم وما جعل عليكم في الدين من حرج ملة أبيكم إبراهيم هو سماكم المسلمين من قبل وفي هذا ليكون الرسول شهيدا عليكم وتكونوا شهداء على الناس فأقيموا الصلاة وآتوا الزكاة واعتصموا بالله هو مولاكم فنعم المولى ونعم النصير
en: And strive hard in Allah's Cause as you ought to strive (with sincerity and with all your efforts that His Name should be superior). He has chosen you (to convey His Message of Islamic Monotheism to mankind by inviting them to His religion of Islam), and has not laid upon you in religion any hardship: it is the religion of your father Ibrahim (Abraham) (Islamic Monotheism). It is He (Allah) Who has named you Muslims both before and in this (the Qur'an), that the Messenger (Muhammad صلى الله عليه وسلم) may be a witness over you and you be witnesses over mankind! So perform As-Salat (Iqamat-as-Salat), give Zakat and hold fast to Allah [i.e. have confidence in Allah, and depend upon Him in all your affairs]. He is your Maula (Patron, Lord), what an Excellent Maula (Patron, Lord) and what an Excellent Helper!

source: قد أفلح المؤمنون
en: Successful indeed are the believers.

source: الذين هم في صلاتهم خاشعون
en: Those who offer their Salat (prayers) with all solemnity and full submissiveness.

source: والذين هم عن اللغو معرضون
en: And those who turn away from Al-Laghw (dirty, false, evil vain talk, falsehood, and all that Allah has forbidden).

source: والذين هم للزكاة فاعلون
en: And those who pay the Zakat.

source: والذين هم لفروجهم حافظون
en: And those who guard their chastity (i.e. private parts, from illegal sexual acts)

source: إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين
en: Except from their wives or (the slaves) that their right hands possess, - for then, they are free from blame;

source: فمن ابتغى وراء ذلك فأولئك هم العادون
en: But whoever seeks beyond that, then those are the transgressors;

source: والذين هم لأماناتهم وعهدهم راعون
en: Those who are faithfully true to their Amanat (all the duties which Allah has ordained, honesty, moral responsibility and trusts) and to their covenants;

source: والذين هم على صلواتهم يحافظون
en: And those who strictly guard their (five compulsory congregational) Salawat (prayers) (at their fixed stated hours).

source: أولئك هم الوارثون
en: These are indeed the inheritors

source: الذين يرثون الفردوس هم فيها خالدون
en: Who shall inherit the Firdaus (Paradise). They shall dwell therein forever.

source: ولقد خلقنا الإنسان من سلالة من طين
en: And indeed We created man (Adam) out of an extract of clay (water and earth).

source: ثم جعلناه نطفة في قرار مكين
en: Thereafter We made him (the offspring of Adam) as a Nutfah (mixed drops of the male and female sexual discharge and lodged it) in a safe lodging (womb of the woman).

source: ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظاما فكسونا العظام لحما ثم أنشأناه خلقا آخر فتبارك الله أحسن الخالقين
en: Then We made the Nutfah into a clot (a piece of thick coagulated blood), then We made the clot into a little lump of flesh, then We made out of that little lump of flesh bones, then We clothed the bones with flesh, and then We brought it forth as another creation. So Blessed is Allah, the Best of creators.

source: ثم إنكم بعد ذلك لميتون
en: After that, surely, you will die.

source: ثم إنكم يوم القيامة تبعثون
en: Then (again), surely, you will be resurrected on the Day of Resurrection.

source: ولقد خلقنا فوقكم سبع طرائق وما كنا عن الخلق غافلين
en: And indeed We have created above you seven heavens (one over the other), and We are never unaware of the creation.

source: وأنزلنا من السماء ماء بقدر فأسكناه في الأرض وإنا على ذهاب به لقادرون
en: And We sent down from the sky water (rain) in (due) measure, and We gave it lodging in the earth, and verily, We are Able to take it away.

source: فأنشأنا لكم به جنات من نخيل وأعناب لكم فيها فواكه كثيرة ومنها تأكلون
en: Then We brought forth for you therewith gardens of date-palms and grapes, wherein is much fruit for you, and whereof you eat.

source: وشجرة تخرج من طور سيناء تنبت بالدهن وصبغ للآكلين
en: And a tree (olive) that springs forth from Mount Sinai, that grows (produces) oil, and (it is a) relish for the eaters.

source: وإن لكم في الأنعام لعبرة نسقيكم مما في بطونها ولكم فيها منافع كثيرة ومنها تأكلون
en: And verily in the cattle there is indeed a lesson for you. We give you to drink (milk) of that which is in their bellies. And there are, in them, numerous (other) benefits for you, and of them you eat.

source: وعليها وعلى الفلك تحملون
en: And on them, and on ships you are carried.

source: ولقد أرسلنا نوحا إلى قومه فقال يا قوم اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And indeed We sent Nuh (Noah) to his people, and he said: "O my people! Worship Allah! You have no other Ilah (God) but Him (Islamic Monotheism). Will you not then be afraid (of Him i.e. of His punishment because of worshipping others besides Him)?"

source: فقال الملأ الذين كفروا من قومه ما هذا إلا بشر مثلكم يريد أن يتفضل عليكم ولو شاء الله لأنزل ملائكة ما سمعنا بهذا في آبائنا الأولين
en: But the chiefs of his people who disbelieved said: "He is no more than a human being like you, he seeks to make himself superior to you. Had Allah willed, He surely could have sent down angels. Never did we hear such a thing among our fathers of old.

source: إن هو إلا رجل به جنة فتربصوا به حتى حين
en: "He is only a man in whom is madness, so wait for him a while."

source: قال رب انصرني بما كذبون
en: [Nuh (Noah)] said: "O my Lord! Help me because they deny me."

source: فأوحينا إليه أن اصنع الفلك بأعيننا ووحينا فإذا جاء أمرنا وفار التنور فاسلك فيها من كل زوجين اثنين وأهلك إلا من سبق عليه القول منهم ولا تخاطبني في الذين ظلموا إنهم مغرقون
en: So We revealed to him (saying): "Construct the ship under Our Eyes and under Our Revelation (guidance). Then, when Our Command comes, and water gushes forth from the oven, take on board of each kind two (male and female), and your family, except those thereof against whom the Word has already gone forth. And address Me not in favour of those who have done wrong. Verily, they are to be drowned.

source: فإذا استويت أنت ومن معك على الفلك فقل الحمد لله الذي نجانا من القوم الظالمين
en: And when you have embarked on the ship, you and whoever is with you, then say: "All the praises and thanks be to Allah, Who has saved us from the people who are Zalimun (i.e. oppressors, wrong-doers, polytheists, those who join others in worship with Allah).

source: وقل رب أنزلني منزلا مباركا وأنت خير المنزلين
en: And say: "My Lord! Cause me to land at a blessed landing-place, for You are the Best of those who bring to land."

source: إن في ذلك لآيات وإن كنا لمبتلين
en: Verily, in this [what We did as regards drowning of the people of Nuh (Noah)], there are indeed Ayat (proofs, evidence, lessons, signs, etc. for men to understand), for sure We are ever putting (men) to the test.

source: ثم أنشأنا من بعدهم قرنا آخرين
en: Then, after them, We created another generation.

source: فأرسلنا فيهم رسولا منهم أن اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And We sent to them a Messenger from among themselves (saying): "Worship Allah! You have no other Ilah (God) but Him. Will you not then be afraid (of Him i.e. of His punishment because of worshipping others besides Him)?"

source: وقال الملأ من قومه الذين كفروا وكذبوا بلقاء الآخرة وأترفناهم في الحياة الدنيا ما هذا إلا بشر مثلكم يأكل مما تأكلون منه ويشرب مما تشربون
en: And the chiefs of his people who disbelieved and denied the Meeting in the Hereafter, and whom We had given the luxuries and comforts of this life, said: "He is no more than a human being like you, he eats of that which you eat, and drinks of what you drink.

source: ولئن أطعتم بشرا مثلكم إنكم إذا لخاسرون
en: "If you were to obey a human being like yourselves, then verily you indeed would be losers.

source: أيعدكم أنكم إذا متم وكنتم ترابا وعظاما أنكم مخرجون
en: "Does he promise you that when you have died and have become dust and bones, you shall come out alive (resurrected)?

source: هيهات هيهات لما توعدون
en: "Far, very far is that which you are promised!

source: إن هي إلا حياتنا الدنيا نموت ونحيا وما نحن بمبعوثين
en: "There is nothing but our life of this world! We die and we live! And we are not going to be resurrected!

source: إن هو إلا رجل افترى على الله كذبا وما نحن له بمؤمنين
en: "He is only a man who has invented a lie against Allah, and we are not going to believe in him."

source: قال عما قليل ليصبحن نادمين
en: (Allah) said: "In a little while, they are sure to be regretful."

source: فأخذتهم الصيحة بالحق فجعلناهم غثاء فبعدا للقوم الظالمين
en: So As-Saihah (torment - awful cry) overtook them in truth (with justice), and We made them as rubbish of dead plants. So away with the people who are Zalimun (polytheists, wrong-doers, disbelievers in the Oneness of Allah, disobedient to His Messengers).

source: ثم أنشأنا من بعدهم قرونا آخرين
en: Then, after them, We created other generations.

source: ثم أرسلنا رسلنا تترى كل ما جاء أمة رسولها كذبوه فأتبعنا بعضهم بعضا وجعلناهم أحاديث فبعدا لقوم لا يؤمنون
en: Then We sent Our Messengers in succession. Every time there came to a nation their Messenger, they denied him; so We made them follow one another (to destruction), and We made them as Ahadith (the true stories for mankind to learn a lesson from them). So away with a people who believe not!

source: ثم أرسلنا موسى وأخاه هارون بآياتنا وسلطان مبين
en: Then We sent Musa (Moses) and his brother Harun‎‎ (Aaron), with Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and manifest authority,

source: إلى فرعون وملئه فاستكبروا وكانوا قوما عالين
en: To Fir'aun (Pharaoh) and his chiefs, but they behaved insolently and they were people self-exalting (by disobeying their Lord, and exalting themselves over and above the Messenger of Allah).

source: فقالوا أنؤمن لبشرين مثلنا وقومهما لنا عابدون
en: They said: "Shall we believe in two men like ourselves, and their people are obedient to us with humility (and we use them to serve us as we like)."

source: فكذبوهما فكانوا من المهلكين
en: So they denied them both [Musa (Moses) and Harun (Aaron)] and became of those who were destroyed.

source: ولقد آتينا موسى الكتاب لعلهم يهتدون
en: And indeed We gave Musa (Moses) the Scripture, that they may be guided.

source: وجعلنا ابن مريم وأمه آية وآويناهما إلى ربوة ذات قرار ومعين
en: And We made the son of Maryam (Mary) and his mother as a sign, and We gave them refuge on high ground, a place of rest, security and flowing streams.

source: يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم
en: O (you) Messengers! Eat of the Tayyibat [all kinds of Halal foods which Allah has made lawful (meat of slaughtered eatable animals, milk products, fats, vegetables, fruits, etc.] and do righteous deeds. Verily! I am Well-Acquainted with what you do.

source: وإن هذه أمتكم أمة واحدة وأنا ربكم فاتقون
en: And verily this your religion (of Islamic Monotheism) is one religion, and I am your Lord, so fear (keep your duty to) Me.

source: فتقطعوا أمرهم بينهم زبرا كل حزب بما لديهم فرحون
en: But they (men) have broken their religion among them into sects, each group rejoicing in what is with it (as its beliefs).

source: فذرهم في غمرتهم حتى حين
en: So leave them in their error for a time.

source: أيحسبون أنما نمدهم به من مال وبنين
en: Do they think that in wealth and children with which We enlarge them

source: نسارع لهم في الخيرات بل لا يشعرون
en: We hasten unto them with good things. Nay, [it is a Fitnah (trial) in this worldly life so that they will have no share of good things in the Hereafter] but they perceive not. [Tafsir Al-Qurtubi].

source: إن الذين هم من خشية ربهم مشفقون
en: Verily those who live in awe for fear of their Lord;

source: والذين هم بآيات ربهم يؤمنون
en: And those who believe in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord;

source: والذين هم بربهم لا يشركون
en: And those who join not anyone (in worship) as partners with their Lord;

source: والذين يؤتون ما آتوا وقلوبهم وجلة أنهم إلى ربهم راجعون
en: And those who give that (their charity) which they give (and also do other good deeds) with their hearts full of fear (whether their alms and charities have been accepted or not), because they are sure to return to their Lord (for reckoning).

source: أولئك يسارعون في الخيرات وهم لها سابقون
en: It is these who hasten in the good deeds, and they are foremost in them [e.g. offering the compulsory Salat (prayers) in their (early) stated, fixed times and so on].

source: ولا نكلف نفسا إلا وسعها ولدينا كتاب ينطق بالحق وهم لا يظلمون
en: And We task not any person except according to his capacity, and with Us is a Record which speaks the truth, and they will not be wronged.

source: بل قلوبهم في غمرة من هذا ولهم أعمال من دون ذلك هم لها عاملون
en: Nay, but their hearts are covered from (understanding) this (the Qur'an), and they have other (evil) deeds, besides, which they are doing.

source: حتى إذا أخذنا مترفيهم بالعذاب إذا هم يجأرون
en: Until when We seize those of them who lead a luxurious life with punishment: behold they make humble invocation with a loud voice.

source: لا تجأروا اليوم إنكم منا لا تنصرون
en: Invoke not loudly this day! Certainly you shall not be helped by Us.

source: قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون
en: Indeed My Verses used to be recited to you, but you used to turn back on your heels (denying them, and refusing with hatred to listen to them).

source: مستكبرين به سامرا تهجرون
en: In pride (they - Quraish pagans and polytheists of Makkah used to feel proud that they are the dwellers of Makkah sanctuary - Haram), talking evil about it (the Qur'an) by night.

source: أفلم يدبروا القول أم جاءهم ما لم يأت آباءهم الأولين
en: Have they not pondered over the Word (of Allah, i.e. what is sent down to the Prophet صلى الله عليه وسلم), or has there come to them what had not come to their fathers of old?

source: أم لم يعرفوا رسولهم فهم له منكرون
en: Or is it that they did not recognize their Messenger (Muhammad صلى الله عليه وسلم) so they deny him?

source: أم يقولون به جنة بل جاءهم بالحق وأكثرهم للحق كارهون
en: Or say they: There is madness in him? Nay, but he brought them the truth [i.e. Tauhid: Worshipping Allah Alone in all aspects, the Qur'an and the religion of Islam], but most of them (the disbelievers) are averse to the truth.

source: ولو اتبع الحق أهواءهم لفسدت السماوات والأرض ومن فيهن بل أتيناهم بذكرهم فهم عن ذكرهم معرضون
en: And if the truth had been in accordance with their desires, verily, the heavens and the earth, and whosoever is therein would have been corrupted! Nay, We have brought them their reminder, but they turn away from their reminder.

source: أم تسألهم خرجا فخراج ربك خير وهو خير الرازقين
en: Or is it that you (O Muhammad صلى الله عليه وسلم) ask them for some wages? But the recompense of your Lord is better, and He is the Best of those who give sustenance.

source: وإنك لتدعوهم إلى صراط مستقيم
en: And certainly, you (O Muhammad صلى الله عليه وسلم) call them to the Straight Path (true religion - Islamic Monotheism).

source: وإن الذين لا يؤمنون بالآخرة عن الصراط لناكبون
en: And verily, those who believe not in the Hereafter are indeed deviating far astray from the Path (true religion - Islamic Monotheism).

source: ولو رحمناهم وكشفنا ما بهم من ضر للجوا في طغيانهم يعمهون
en: And though We had mercy on them and removed the distress which is on them, still they would obstinately persist in their transgression, wandering blindly.

source: ولقد أخذناهم بالعذاب فما استكانوا لربهم وما يتضرعون
en: And indeed We seized them with punishment, but they humbled not themselves to their Lord, nor did they invoke (Allah) with submission to Him.

source: حتى إذا فتحنا عليهم بابا ذا عذاب شديد إذا هم فيه مبلسون
en: Until, when We open for them the gate of severe punishment, then lo! they will be plunged into destruction with deep regrets, sorrows and in despair.

source: وهو الذي أنشأ لكم السمع والأبصار والأفئدة قليلا ما تشكرون
en: It is He Who has created for you (the sense of) hearing (ears), eyes (sight), and hearts (understanding). Little thanks you give.

source: وهو الذي ذرأكم في الأرض وإليه تحشرون
en: And it is He Who has created you on the earth, and to Him you shall be gathered back.

source: وهو الذي يحيي ويميت وله اختلاف الليل والنهار أفلا تعقلون
en: And it is He Who gives life and causes death, and His is the alternation of night and day. Will you not then understand?

source: بل قالوا مثل ما قال الأولون
en: Nay, but they say the like of what the men of old said.

source: قالوا أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: They said: "When we are dead and have become dust and bones, shall we be resurrected indeed?

source: لقد وعدنا نحن وآباؤنا هذا من قبل إن هذا إلا أساطير الأولين
en: "Verily, this we have been promised - we and our fathers before (us)! This is only the tales of the ancients!"

source: قل لمن الأرض ومن فيها إن كنتم تعلمون
en: Say: "Whose is the earth and whosoever is therein? If you know!"

source: سيقولون لله قل أفلا تذكرون
en: They will say: "It is Allah's!" Say: "Will you not then remember?"

source: قل من رب السماوات السبع ورب العرش العظيم
en: Say: "Who is (the) Lord of the seven heavens, and (the) Lord of the Great Throne?"

source: سيقولون لله قل أفلا تتقون
en: They will say: "Allah." Say: "Will you not then fear Allah (believe in His Oneness, obey Him, believe in the Resurrection and Recompense for every good or bad deed)?"

source: قل من بيده ملكوت كل شيء وهو يجير ولا يجار عليه إن كنتم تعلمون
en: Say "In Whose Hand is the sovereignty of everything (i.e. treasures of each and everything)? And He protects (all), while against Whom there is no protector, (i.e. if Allah saves anyone none can punish or harm him, and if Allah punishes or harms anyone none can save him), if you know?" [Tafsir Al-Qurtubi]

source: سيقولون لله قل فأنى تسحرون
en: They will say: "(All that belongs) to Allah." Say: "How then are you deceived and turn away from the truth?"

source: بل أتيناهم بالحق وإنهم لكاذبون
en: Nay, but We have brought them the truth (Islamic Monotheism), and verily, they (disbelievers) are liars.

source: ما اتخذ الله من ولد وما كان معه من إله إذا لذهب كل إله بما خلق ولعلا بعضهم على بعض سبحان الله عما يصفون
en: No son (or offspring) did Allah beget, nor is there any ilah (god) along with Him. (If there had been many gods), then each god would have taken away what he had created, and some would have tried to overcome others! Glorified be Allah above all that they attribute to Him!

source: عالم الغيب والشهادة فتعالى عما يشركون
en: All-Knower of the unseen and the seen! Exalted be He over all that they associate as partners to Him!

source: قل رب إما تريني ما يوعدون
en: Say (O Muhammad صلى الله عليه وسلم): "My Lord! If You would show me that with which they are threatened (torment),

source: رب فلا تجعلني في القوم الظالمين
en: "My Lord! Then (save me from Your punishment), put me not amongst the people who are the Zalimun (polytheists and wrong-doers)."

source: وإنا على أن نريك ما نعدهم لقادرون
en: And indeed We are Able to show you (O Muhammad صلى الله عليه وسلم) that with which We have threatened them.

source: ادفع بالتي هي أحسن السيئة نحن أعلم بما يصفون
en: Repel evil with that which is better. We are Best-Acquainted with the things they utter.

source: وقل رب أعوذ بك من همزات الشياطين
en: And say: "My Lord! I seek refuge with You from the whisperings (suggestions) of the Shayatin (devils).

source: وأعوذ بك رب أن يحضرون
en: "And I seek refuge with You, My Lord! lest they should come near me."

source: حتى إذا جاء أحدهم الموت قال رب ارجعون
en: Until, when death comes to one of them (those who join partners with Allah), he says: "My Lord! Send me back,

source: لعلي أعمل صالحا فيما تركت كلا إنها كلمة هو قائلها ومن ورائهم برزخ إلى يوم يبعثون
en: "So that I may do good in that which I have left behind!" No! It is but a word that he speaks; and behind them is Barzakh (a barrier) until the Day when they will be resurrected.

source: فإذا نفخ في الصور فلا أنساب بينهم يومئذ ولا يتساءلون
en: Then, when the Trumpet is blown, there will be no kinship among them that Day, nor will they ask of one another.

source: فمن ثقلت موازينه فأولئك هم المفلحون
en: Then, those whose scales (of good deeds) are heavy, they are the successful.

source: ومن خفت موازينه فأولئك الذين خسروا أنفسهم في جهنم خالدون
en: And those whose scales (of good deeds) are light, they are those who lose their ownselves, in Hell will they abide.

source: تلفح وجوههم النار وهم فيها كالحون
en: The Fire will burn their faces, and therein they will grin, with displaced lips (disfigured).

source: ألم تكن آياتي تتلى عليكم فكنتم بها تكذبون
en: "Were not My Verses (this Qur'an) recited to you, and then you used to deny them?"

source: قالوا ربنا غلبت علينا شقوتنا وكنا قوما ضالين
en: They will say: "Our Lord! Our wretchedness overcame us, and we were (an) erring people.

source: ربنا أخرجنا منها فإن عدنا فإنا ظالمون
en: "Our Lord! Bring us out of this. If ever we return (to evil), then indeed we shall be Zalimun: (polytheists, oppressors, unjust, and wrong-doers)."

source: قال اخسئوا فيها ولا تكلمون
en: He (Allah) will say: "Remain you in it with ignominy! And speak you not to Me!"

source: إنه كان فريق من عبادي يقولون ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين
en: Verily there was a party of My slaves, who used to say: "Our Lord! We believe, so forgive us, and have mercy on us, for You are the Best of all who show mercy!"
